JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_xspi.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.xspi"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define FREQ_1MHz             (1000000UL)
#define XSPI_LUT_KEY_VAL   (0x5AF05AF0UL)

#define XSPI_TX_WATERMARK_DEFAULT            (0x8U)
#define XSPI_RX_WATERMARK_DEFAULT            (0x8U)

#define XSPI_HIGH_SAMPLE_FREQUENCY    (13000000UL)

/*! @brief Common sets of flags used by the driver, _xspi_flag_constants. */
enum kXSPI_Flags
{
    /*! IRQ sources enabled by the non-blocking transactional API. */
    kIrqFlags = kXSPI_TxBufferFillFlag | kXSPI_TxBufferUnderrunFlag | kXSPI_RxBufferOverflowFlag |
                kXSPI_RxBufferDrainFlag | kXSPI_IllegalInstructionErrorFlag |
                kXSPI_IpCmdtriggerErrorFlag,

    /*! IP CMD Errors to check for. */
    kIpcmdErrorFlags = kXSPI_IllegalInstructionErrorFlag | kXSPI_IpCmdtriggerErrorFlag,

    kFlashProtectionErrorFlags = kXSPI_FradMatchErrorFlag | kXSPI_FradnAccErrorFlag |
                kXSPI_IpsErrorFlag | kXSPI_Tg0SfarErrorFlag |
                kXSPI_Tg1SfarErrorFlag | kXSPI_TgnIpcrErrorFlag,
};

/* XSPI FSM status. */
enum
{
    kXSPI_TransactionIsGrantedXSPIsBusy = 0x0U,    /*!< Transaction is granted, but XSPI is busy
                                                     with any previous DMA transaction is ongoing*/
    kXSPI_TbdrLockIsOpen = 0x1U,                   /*!< TBDR lock is open. IPS master can write in TBDR.*/
    kXSPI_WriteTransferIsTriggered = 0x2U,           /*!< Write transfer is triggered. SEQID is written to XSPI.*/
    kXSPI_ReadTransferIsTriggered = 0x3U,           /*!< Read transfer is triggered. SEQID is written to XSPI.*/
};

/* XSPI transfer state, _xspi_transfer_state. */
enum
{
    kXSPI_Idle      = 0x0U, /*!< Transfer is done. */
    kXSPI_BusyWrite = 0x1U, /*!< XSPI is busy write transfer. */
    kXSPI_BusyRead  = 0x2U, /*!< XSPI is busy write transfer. */
};


/*! @brief Typedef for interrupt handler. */
typedef void (*xspi_isr_t)(XSPI_Type *base, xspi_handle_t *handle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void XSPI_Memset(void *src, uint8_t value, size_t length);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Pointers to xspi bases for each instance. */
static XSPI_Type *const s_xspiBases[] = XSPI_BASE_PTRS;

/*! @brief Pointers to xspi IRQ number for each instance. */
static const IRQn_Type s_xspiIrqs[] = XSPI_IRQS;

/*! @brief Pointers to xspi amba base for each instance. */
static uint32_t s_xspiAmbaBase[] = XSPI_AMBA_BASES;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Clock name array */
static const clock_ip_name_t s_xspiClock[] = XSPI_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! @brief Pointers to XSPI resets for each instance. */
static const reset_ip_name_t s_xspiResets[] = XSPI_RSTS;
/*******************************************************************************
 * Code
 ******************************************************************************/
/* To avoid compiler opitimizing this API into memset() in library. */
#if defined(__ICCARM__)
#pragma optimize = none
#endif /* defined(__ICCARM__) */

static void XSPI_Memset(void *src, uint8_t value, size_t length)
{
    assert(src != NULL);
    uint8_t *p = src;

    for (uint32_t i = 0U; i < length; i++)
    {
        *p = value;
        p++;
    }
}

void XSPI_IPS_CMD_WaitFinish(XSPI_Type *base)
{
    while ((base->SR & XSPI_SR_IP_ACC_MASK) != 0U)
    {
    }

    while ((base->FR & XSPI_FR_TFF_MASK) == 0U)
    {
    }
}

uint32_t XSPI_GetInstance(XSPI_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_xspiBases); instance++)
    {
        if (s_xspiBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_xspiBases));

    return instance;
}

status_t XSPI_CheckAndClearError(XSPI_Type *base, uint32_t status)
{
    status_t result = kStatus_Success;

    /* Check for error. */
    status &= (uint32_t)kFlashProtectionErrorFlags;
    if (0U != status)
    {
        /* Select the correct error code.. */
        if (0U != (status & (uint32_t)kXSPI_SequenceExecutionTimeoutFlag))
        {
            result = kStatus_XSPI_SequenceExecutionTimeout;
            /* Clear the flags. */
            base->ERRSTAT |= kXSPI_SequenceExecutionTimeoutFlag;
        }
        else if (0U != ((status & (uint32_t)kXSPI_FradMatchErrorFlag) | (status & (uint32_t)kXSPI_FradnAccErrorFlag)))
        {
            result = kStatus_XSPI_FradCheckError;
            /* Clear the flags. */
            if (0U != (status & (uint32_t)kXSPI_FradMatchErrorFlag))
            {
                base->ERRSTAT |= kXSPI_FradMatchErrorFlag;
            }
            else
            {
                base->ERRSTAT |= kXSPI_FradnAccErrorFlag;
            }
        }
        else if (0U != (status & (uint32_t)kXSPI_IpsErrorFlag))
        {
            result = kStatus_XSPI_IpsBusTransError;
            /* Clear the flags. */
            base->IPSERROR |= XSPI_IPSERROR_CLR_MASK;
        }
        else if (0U != ((status & (uint32_t)kXSPI_Tg0SfarErrorFlag) | (status & (uint32_t)kXSPI_Tg1SfarErrorFlag)
                        | (status & (uint32_t)kXSPI_TgnIpcrErrorFlag)))
        {
            result = kStatus_XSPI_TgQueueWritingError;
            /* Clear the flags. */
            if (0U != ((status & (uint32_t)kXSPI_Tg0SfarErrorFlag) | (status & (uint32_t)kXSPI_Tg1SfarErrorFlag)))
            {
                base->TGSFARS |= XSPI_TGSFARS_CLR_MASK;
            }
            else
            {
                base->TGIPCRS |= XSPI_TGIPCRS_CLR_MASK;
            }
        }
        else
        {
            assert(false);
        }

        /* Reset fifos. These flags clear automatically. */
        base->MCR |= XSPI_MCR_CLR_RXF_MASK;
        base->MCR |= XSPI_MCR_CLR_TXF_MASK;
    }

    return result;
}


/*!
 * brief Initializes the XSPI module and internal state.
 *
 * This function  configures the XSPI with the
 * input configure parameters. Users should call this function before any XSPI operations.
 *
 * param base XSPI peripheral base address.
 * param config XSPI configure structure.
 */

void XSPI_Init(XSPI_Type *base, const xspi_config_t *config)
{
    uint32_t configValue = 0;
    uint32_t instance = XSPI_GetInstance(base);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable the xspi clock */
    (void)CLOCK_EnableClock(s_xspiClock[XSPI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* Reset the XSPI module */
    RESET_PeripheralReset(s_xspiResets[XSPI_GetInstance(base)]);

