JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
    /*XSPI configuratio items*/
    configValue = XSPI_MCR_DOZE(config->enableDoze) |
                  XSPI_MCR_DQS_EN(config->enableDqs) | XSPI_MCR_DQS_OUT_EN(config->enableDqsOut) |
                  XSPI_MCR_DQS_FA_SEL(config->rxSampleClock) | XSPI_MCR_DQS_LAT_EN(config->enableDqsLatency) |
                  XSPI_MCR_DLPEN(config->enableDataLearn) | XSPI_MCR_VAR_LAT_EN(config->enableVariableLat) |
                  XSPI_MCR_CKN_FA_EN(config->enableCknPad) | XSPI_MCR_END_CFG(config->byteOrder);
    base->MCR = configValue;

    /*XSPI IP SFP configurations*/
    base->MGC = XSPI_MGC_GVLD(config->enableGloAccCtr) | XSPI_MGC_GVLDMDAD(config->mdadConfig.enableMdad) |
                XSPI_MGC_GVLDFRAD(config->fradConfig.enableFrad);

    /*XSPI IP SFP TG0MDAD TG1MDAD configurations*/
    if(config->enableGloAccCtr & config->mdadConfig.enableMdad)
    {
    configValue = XSPI_TG0MDAD_MIDMATCH(config->mdadConfig.tgmdad[0].masterIdReference)  |
                  XSPI_TG0MDAD_VLD(config->mdadConfig.tgmdad[0].assignIsValid) |
                  XSPI_TG0MDAD_SA(config->mdadConfig.tgmdad[0].secureAttribute) |
                  XSPI_TG0MDAD_MASKTYPE(config->mdadConfig.tgmdad[0].maskType) |
                  XSPI_TG0MDAD_MASK(config->mdadConfig.tgmdad[0].mask) |
                  XSPI_TG0MDAD_LCK(config->mdadConfig.tgmdad[0].enableDescriptorLock);
    base->TG0MDAD = configValue;

    configValue = XSPI_TG1MDAD_MIDMATCH(config->mdadConfig.tgmdad[1].masterIdReference)  |
                  XSPI_TG1MDAD_VLD(config->mdadConfig.tgmdad[1].assignIsValid) |
                  XSPI_TG1MDAD_SA(config->mdadConfig.tgmdad[1].secureAttribute) |
                  XSPI_TG1MDAD_MASKTYPE(config->mdadConfig.tgmdad[1].maskType) |
                  XSPI_TG1MDAD_MASK(config->mdadConfig.tgmdad[1].mask) |
                  XSPI_TG1MDAD_LCK(config->mdadConfig.tgmdad[1].enableDescriptorLock);
    base->TG1MDAD = configValue;
    }

    /*XSPI IP FRAD configurations*/
    if(config->enableGloAccCtr & config->fradConfig.enableFrad)
    {
    /* Configure start/end address, access control */
    base->FRAD0_WORD0 = config->fradConfig.frad[0].startAddress;
    base->FRAD0_WORD1 = config->fradConfig.frad[0].endAddress;
    /* R/W enable for all Secure mode */
    base->FRAD0_WORD2 = XSPI_FRAD0_WORD2_MD0ACP(config->fradConfig.frad[0].tg0MasterAccess) |
                        XSPI_FRAD0_WORD2_MD1ACP(config->fradConfig.frad[0].tg1MasterAccess);
    base->FRAD0_WORD3 = XSPI_FRAD0_WORD3_VLD(config->fradConfig.frad[0].assignIsValid);
    }

    /* XSPI Configure AHB rx buffer0. */
    configValue = base->BUF0CR;
    configValue &= ~(XSPI_BUF0CR_HP_EN_MASK | XSPI_BUF0CR_SUB_DIV_EN_MASK |
                         XSPI_BUF0CR_MSTRID_MASK | XSPI_BUF0CR_ADATSZ_MASK);
    configValue |= XSPI_BUF0CR_HP_EN(config->ahbConfig.buffer[0].enaPri.enablePriority) |
                   XSPI_BUF0CR_SUB_DIV_EN(config->ahbConfig.buffer[0].enableSubdivision) |
                   XSPI_BUF0CR_ADATSZ(config->ahbConfig.buffer[0].transferSize) |
                   XSPI_BUF0CR_MSTRID(config->ahbConfig.buffer[0].masterIndex);
    /*config subbuffer division*/
    if(config->ahbConfig.buffer[0].enableSubdivision)
    {
    configValue |= XSPI_BUF0CR_SUBBUF0_DIV(config->ahbConfig.buffer[0].subBuffer[0]) |
                   XSPI_BUF0CR_SUBBUF1_DIV(config->ahbConfig.buffer[0].subBuffer[1]) |
                   XSPI_BUF0CR_SUBBUF2_DIV(config->ahbConfig.buffer[0].subBuffer[2]);
    }
    base->BUF0CR = configValue;

    configValue = base->BUFIND[0];
    configValue &= ~XSPI_BUFIND_TPINDX_MASK;
    configValue |= XSPI_BUFIND_TPINDX(config->ahbConfig.buffer[0].topIndex);
    base->BUFIND[0] = configValue;

    /* XSPI Configure AHB rx buffer1. */
    configValue = base->BUF1CR;
    configValue &= ~(XSPI_BUF1CR_HP_EN_MASK | XSPI_BUF1CR_SUB_DIV_EN_MASK |
                         XSPI_BUF1CR_MSTRID_MASK | XSPI_BUF1CR_ADATSZ_MASK);
    configValue |= XSPI_BUF1CR_HP_EN(config->ahbConfig.buffer[1].enaPri.enablePriority) |
                   XSPI_BUF1CR_SUB_DIV_EN(config->ahbConfig.buffer[1].enableSubdivision) |
                   XSPI_BUF1CR_ADATSZ(config->ahbConfig.buffer[1].transferSize) |
                   XSPI_BUF1CR_MSTRID(config->ahbConfig.buffer[1].masterIndex);
    /*config subbuffer1 division*/
    if(config->ahbConfig.buffer[1].enableSubdivision)
    {
    configValue |= XSPI_BUF0CR_SUBBUF0_DIV(config->ahbConfig.buffer[1].subBuffer[0]) |
                   XSPI_BUF0CR_SUBBUF1_DIV(config->ahbConfig.buffer[1].subBuffer[1]) |
                   XSPI_BUF0CR_SUBBUF2_DIV(config->ahbConfig.buffer[1].subBuffer[2]);
    }
    base->BUF1CR = configValue;

    configValue = base->BUFIND[1];
    configValue &= ~XSPI_BUFIND_TPINDX_MASK;
    configValue |= XSPI_BUFIND_TPINDX(config->ahbConfig.buffer[1].topIndex);
    base->BUFIND[1] = configValue;

    /* XSPI Configure AHB rx buffer2. */
    configValue = base->BUF2CR;
    configValue &= ~(XSPI_BUF2CR_SUB_DIV_EN_MASK |
                         XSPI_BUF2CR_MSTRID_MASK | XSPI_BUF2CR_ADATSZ_MASK);
    configValue |= XSPI_BUF2CR_SUB_DIV_EN(config->ahbConfig.buffer[2].enableSubdivision) |
                   XSPI_BUF2CR_ADATSZ(config->ahbConfig.buffer[2].transferSize) |
                   XSPI_BUF2CR_MSTRID(config->ahbConfig.buffer[2].masterIndex);
    /*config subbuffer2 division*/
    if(config->ahbConfig.buffer[2].enableSubdivision)
    {
    configValue |= XSPI_BUF0CR_SUBBUF0_DIV(config->ahbConfig.buffer[2].subBuffer[0]) |
                   XSPI_BUF0CR_SUBBUF1_DIV(config->ahbConfig.buffer[2].subBuffer[1]) |
                   XSPI_BUF0CR_SUBBUF2_DIV(config->ahbConfig.buffer[2].subBuffer[2]);
    }
    base->BUF2CR = configValue;

    configValue = base->BUFIND[2];
    configValue &= ~XSPI_BUFIND_TPINDX_MASK;
    configValue |= XSPI_BUFIND_TPINDX(config->ahbConfig.buffer[2].topIndex);
    base->BUFIND[2] = configValue;


    /* XSPI Configure AHB rx buffer3. */
    configValue = base->BUF3CR;
    configValue &= ~(XSPI_BUF3CR_ALLMST_MASK | XSPI_BUF3CR_SUB_DIV_EN_MASK |
                         XSPI_BUF3CR_MSTRID_MASK | XSPI_BUF3CR_ADATSZ_MASK);
    configValue |= XSPI_BUF3CR_ALLMST(config->ahbConfig.buffer[3].enaPri.enableAllMaster) |
                   XSPI_BUF3CR_SUB_DIV_EN(config->ahbConfig.buffer[3].enableSubdivision) |
                   XSPI_BUF3CR_ADATSZ(config->ahbConfig.buffer[3].transferSize) |
                   XSPI_BUF3CR_MSTRID(config->ahbConfig.buffer[3].masterIndex);
    /*config subbuffer3 division*/
    if(config->ahbConfig.buffer[3].enableSubdivision)
    {
    configValue |= XSPI_BUF0CR_SUBBUF0_DIV(config->ahbConfig.buffer[3].subBuffer[0]) |
                   XSPI_BUF0CR_SUBBUF1_DIV(config->ahbConfig.buffer[3].subBuffer[1]) |
                   XSPI_BUF0CR_SUBBUF2_DIV(config->ahbConfig.buffer[3].subBuffer[2]);
    }
    base->BUF3CR = configValue;

    /*AHB prefech*/
    configValue = base->SPTRCLR;
    configValue |= XSPI_SPTRCLR_PREFETCH_DIS(!(config->ahbConfig.enableAHBPrefetch));
    base->SPTRCLR = configValue;

    /*Page Program Wait Write enable*/
    configValue = base->AWRCR;
    configValue |= XSPI_AWRCR_PPW_WR_DIS(!(config->ahbConfig.enableAHBWaitWrite));
    base->AWRCR = configValue;

