JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
    /*Page Program Wait read enable*/
    configValue = base->AWRCR;
    configValue |= XSPI_AWRCR_PPW_RD_DIS(!(config->ahbConfig.enableAHBWaitRead));
    base->AWRCR = configValue;

    /*XSPI ahb alignment  slite config*/
    configValue = base->BFGENCR;
    configValue |= XSPI_BFGENCR_ALIGN(config->ahbConfig.ahbAlignment) |
            XSPI_BFGENCR_SPLITEN(config->ahbConfig.enableAHBSlite);
    if (config->ahbConfig.enableAHBSlite)
    {
        if (instance == 0UL || instance == 1UL)
        {
            /*XSPI ahb Alignment config only support XSPI0 XSPI1*/
            configValue |= XSPI_BFGENCR_AHBSSIZE(config->ahbConfig.ahbSplitSize);
        }
    }
    base->BFGENCR |= configValue;

    /* XSPI Configure IP Fifo watermarks. */
    base->RBCT &= ~XSPI_RBCT_WMRK_MASK;
    base->RBCT |= XSPI_RBCT_WMRK((uint32_t)config->rxWatermark / 4U - 1U);
    base->TBCT &= ~XSPI_TBCT_WMRK_MASK;
    base->TBCT |= XSPI_TBCT_WMRK((uint32_t)config->txWatermark / 4U);

    /* Reset flash size on all ports */

}

/*!
 * brief Gets default settings for XSPI.
 *
 * param base XSPI peripheral base address.
 * param config XSPI configuration structure.
 * param devconfig Flash configuration parameters.

 */
void XSPI_GetDefaultConfig(XSPI_Type *base, xspi_config_t *config, xspi_device_config_t *devconfig)
{
    uint32_t instance = XSPI_GetInstance(base);

    /* Initializes the configure structure to zero. */
    XSPI_Memset(config, 0, sizeof(*config));

    config->rxSampleClock          = kXSPI_ReadSampleClkExternalInputFromDqsPad;
    config->byteOrder              = kXSPI_64BitLE;
    config->enableDoze             = true;
    config->enableDqs              = true;
    config->enableDqsOut           = false; /*only for psram*/
    config->enableDqsLatency       = false;
    config->enableDataLearn        = false; /* only for sample clock source set to LoopbackFromDqsPad */
    config->enableVariableLat      = false;
    config->enableCknPad           = false;

    config->txWatermark            = XSPI_TX_WATERMARK_DEFAULT;
    config->rxWatermark            = XSPI_RX_WATERMARK_DEFAULT;

    /*XSPI IP SFP configurations*/
    config->enableGloAccCtr        = true;
    config->mdadConfig.enableMdad  = true;
    config->fradConfig.enableFrad  = true;
    /*Mdad Config*/
    XSPI_Memset(config->mdadConfig.tgmdad, 0, sizeof(config->mdadConfig.tgmdad));

    config->mdadConfig.tgmdad[0].assignIsValid     = true;
    config->mdadConfig.tgmdad[0].secureAttribute   = kXSPI_AttributeMasterNonsecureSecureBoth;

    config->mdadConfig.tgmdad[1].assignIsValid     = true;
    config->mdadConfig.tgmdad[1].secureAttribute   = kXSPI_AttributeMasterNonsecureSecureBoth;

    /*Frad Config*/
    XSPI_Memset(config->fradConfig.frad, 0, sizeof(config->fradConfig.frad));
    config->fradConfig.frad[0].startAddress  = s_xspiAmbaBase[instance];

    /*flashBase + XSPI_MEMORY_SIZE*/
    config->fradConfig.frad[0].endAddress = (uint32_t)(s_xspiAmbaBase[instance]) +
            (uint32_t) ((devconfig->flashA1Size) << 10);
    config->fradConfig.frad[0].tg0MasterAccess = 0x6U;
    config->fradConfig.frad[0].tg1MasterAccess = 0x6U;
    config->fradConfig.frad[0].assignIsValid   = true;

    XSPI_Memset(config->ahbConfig.buffer, 0, sizeof(config->ahbConfig.buffer));

    /*  AHB buffer0 default config. */
    config->ahbConfig.buffer[0].enaPri.enablePriority = false;
    config->ahbConfig.buffer[0].enableSubdivision = false;
    config->ahbConfig.buffer[0].transferSize = 0x20U;
    config->ahbConfig.buffer[0].masterIndex = 0xFU; /* Invalid master index which is not used, so will never hit. */
    config->ahbConfig.buffer[0].topIndex = 0x30;
    /*  AHB buffer1 default config. */
    config->ahbConfig.buffer[1].enaPri.enablePriority = false;
    config->ahbConfig.buffer[1].enableSubdivision = false;
    config->ahbConfig.buffer[1].transferSize = 0x20U;
    config->ahbConfig.buffer[1].masterIndex = 0xFU; /* Invalid master index which is not used, so will never hit. */
    config->ahbConfig.buffer[1].topIndex = 0x60;
    /*  AHB buffer2 default config. */
    config->ahbConfig.buffer[2].enableSubdivision = false;
    config->ahbConfig.buffer[2].transferSize = 0x20U;
    config->ahbConfig.buffer[2].masterIndex = 0xFU; /* Invalid master index which is not used, so will never hit. */
    config->ahbConfig.buffer[2].topIndex = 0x90;
    /*  AHB buffer3 default config. */
    config->ahbConfig.buffer[3].enaPri.enableAllMaster = true;
    config->ahbConfig.buffer[3].enableSubdivision = false;
    config->ahbConfig.buffer[3].transferSize = 0x20U;
    config->ahbConfig.buffer[3].masterIndex = 0xFU; /* Invalid master index which is not used, so will never hit. */


    config->ahbConfig.enableAHBPrefetch  = false;
    config->ahbConfig.enableAHBWaitWrite = true;
    config->ahbConfig.enableAHBWaitRead  = true;
    config->ahbConfig.enableAHBSlite     = false;

    /* Dll default device config */
    devconfig->dllConfig.slaveFineOffset         = 0;
    devconfig->dllConfig.dllReferenceCounter     = 2U;
    devconfig->dllConfig.dllResolution           = 4U;
    devconfig->dllConfig.enableCdl8              = true;
    /* sample default device config */
    devconfig->smprConfig.tapNumber = 4U;
    devconfig->smprConfig.delayWithRef = kXSPI_SameWithDqs;
    devconfig->smprConfig.enableAtInvertedClock = 0;
}

/*!
 * brief Deinitializes the XSPI module.
 *
 * Clears the XSPI state and  XSPI module registers.
 * param base XSPI peripheral base address.
 */
void XSPI_Deinit(XSPI_Type *base)
{
    /* Reset peripheral. */
    XSPI_SoftwareReset(base);
}

/*!
 * brief Update XSPI DLL value depending on currently xspi root clock.
 *
 * param base XSPI peripheral base address.
 * param devconfig Flash configuration parameters.
 */
static void XSPI_UpdateDllValue(XSPI_Type *base, xspi_device_config_t *devconfig)
{
    uint32_t configValue = 0;
    uint32_t smprValue = 0;
    uint32_t rxSampleClock = (base->MCR & XSPI_MCR_DQS_FA_SEL_MASK) >> XSPI_MCR_DQS_FA_SEL_SHIFT;
    bool enableDataLearn = (base->MCR & XSPI_MCR_DLPEN_MASK) >> XSPI_MCR_DLPEN_SHIFT;

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    /* SDR and Bypass mode need config slaveDelayCoarse dllResolution and disable auto mode*/
    if ((!devconfig->enableDdr) && (devconfig->dllConfig.dllMode == kXSPI_BypassMode))
    {
        devconfig->dllConfig.slaveDelayCoarse   = 7U;
        devconfig->dllConfig.dllResolution      = 2U;
    }

