JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
    /* SDR and Auto mode need config slaveFineOffset */
    if ((!devconfig->enableDdr) && (devconfig->dllConfig.dllMode == kXSPI_AutoUpdateMode))
    {
        devconfig->dllConfig.slaveFineOffset = 2U;
    }

    /* Look back form DQS and Data learn need config dllResolution and dllReferenceCounter */
    if (enableDataLearn && (kXSPI_ReadSampleClkLoopbackFromDqsPad == rxSampleClock))
    {
        devconfig->dllConfig.dllResolution       = 6U;
        devconfig->dllConfig.dllReferenceCounter = 1U;
    }

    /* Bypass mode need config dllReferenceCounter and disable auto mode */
    if (devconfig->dllConfig.dllMode == kXSPI_BypassMode)
    {
        devconfig->dllConfig.dllReferenceCounter = 1U;
    }

    base->DLLCR[0] &=~ XSPI_DLLCR_SLV_UPD_MASK;
    base->DLLCR[0] |= XSPI_DLLCR_SLV_EN_MASK;
    base->DLLCR[0] |= XSPI_DLLCR_SLV_DLY_FINE_MASK;
    configValue = base->DLLCR[0];

    configValue |= XSPI_DLLCR_DLL_REFCNTR(devconfig->dllConfig.dllReferenceCounter) |
              XSPI_DLLCR_DLLRES(devconfig->dllConfig.dllResolution) |
              XSPI_DLLCR_SLV_DLY_COARSE(devconfig->dllConfig.slaveDelayCoarse) |
              XSPI_DLLCR_SLV_DLY_OFFSET(devconfig->dllConfig.slaveDelayOffset) |
              XSPI_DLLCR_SLV_FINE_OFFSET(devconfig->dllConfig.slaveFineOffset) |
              XSPI_DLLCR_DLL_CDL8(devconfig->dllConfig.enableCdl8);

    if (devconfig->dllConfig.dllMode == kXSPI_BypassMode)
	{
        configValue |= XSPI_DLLCR_SLV_DLL_BYPASS_MASK;
    }
	else if (devconfig->dllConfig.dllMode == kXSPI_AutoUpdateMode)
    {
        configValue |= XSPI_DLLCR_SLAVE_AUTO_UPDT_MASK;
	}

    if (devconfig->xspiRootClk > XSPI_HIGH_SAMPLE_FREQUENCY)
    {
        configValue |= XSPI_DLLCR_FREQEN_MASK;
    }

    base->DLLCR[0] |= configValue;
    base->DLLCR[0] |= XSPI_DLLCR_SLV_UPD_MASK;

    if (devconfig->dllConfig.dllMode == kXSPI_BypassMode)
	{
        /* Bypass mode need check slave delay chain locked */
        while(!((base->DLLSR & XSPI_DLLSR_SLVA_LOCK_MASK) == XSPI_DLLSR_SLVA_LOCK_MASK));
    }
	else if (devconfig->dllConfig.dllMode == kXSPI_AutoUpdateMode)
    {
        /* Auto mode need check slave delay chain and master delay chain both locked */
        while(!(((base->DLLSR & XSPI_DLLSR_SLVA_LOCK_MASK) == XSPI_DLLSR_SLVA_LOCK_MASK) &&
                 ((base->DLLSR & XSPI_DLLSR_DLLA_LOCK_MASK) == XSPI_DLLSR_DLLA_LOCK_MASK)));
	}
    base->DLLCR[0] &=~ XSPI_DLLCR_SLV_UPD_MASK;

    if (!devconfig->enableDdr)
    {
        devconfig->smprConfig.tapNumber = 7U;
        devconfig->smprConfig.delayWithRef = kXSPI_HalfCycleEarlyDqs;
        devconfig->smprConfig.enableAtInvertedClock = true;
    }

    if (enableDataLearn && (kXSPI_ReadSampleClkLoopbackFromDqsPad == rxSampleClock))
    {
        devconfig->smprConfig.tapNumber = 0U;
        devconfig->smprConfig.delayWithRef = kXSPI_HalfCycleEarlyDqs;
        devconfig->smprConfig.enableAtInvertedClock = true;
    }
    /* selecting tap number in slave delay chain tem 4*/
    smprValue = base->SMPR;
    smprValue |= XSPI_SMPR_DLLFSMPFA(devconfig->smprConfig.tapNumber) |
                 XSPI_SMPR_FSDLY(devconfig->smprConfig.delayWithRef) |
                 XSPI_SMPR_FSPHS(devconfig->smprConfig.enableAtInvertedClock);
    base->SMPR = smprValue;
}

/*!
 * brief Configures the connected device parameter.
 *
 * This function configures the connected device relevant parameters, such as the size, command, and so on.
 * The flash configuration value cannot have a default value. The user needs to configure it according to the
 * connected device.
 *
 * @param base XSPI peripheral base address.
 * param devconfig Flash configuration parameters.
 */
void XSPI_SetFlashConfig(XSPI_Type *base, xspi_device_config_t *devconfig)
{
    uint32_t configValue = 0;
    uint32_t instance = XSPI_GetInstance(base);
    uint32_t rxSampleClock = (base->MCR & XSPI_MCR_DQS_FA_SEL_MASK) >> XSPI_MCR_DQS_FA_SEL_SHIFT;
    bool enableDataLearn = (base->MCR & XSPI_MCR_DLPEN_MASK) >> XSPI_MCR_DLPEN_SHIFT;

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    if (enableDataLearn && (kXSPI_ReadSampleClkLoopbackFromDqsPad == rxSampleClock))
    {
        devconfig->CSHoldTime = 2U;
        devconfig->CSSetupTime = 2U;
    }

    base->FLSHCR = XSPI_FLSHCR_TCSS(devconfig->CSSetupTime) | XSPI_FLSHCR_TCSH(devconfig->CSHoldTime);

    if(devconfig->enableDdr)
    {
        configValue = base->MCR;
        configValue |= XSPI_MCR_DDR_EN(devconfig->enableDdr);
        base->MCR = configValue;
        configValue = base->FLSHCR;
        configValue |= XSPI_FLSHCR_TDH(devconfig->sampleTimeRef);
        base->FLSHCR = configValue;
    }

    /*!< Enable X16 Mode. Only for default 16 I/O bus PSRAM*/
    if(devconfig->enableX16Mode)
    {
        configValue = base->MCR;
        configValue |= XSPI_MCR_X16_EN_MASK;
        base->MCR = configValue;
    }

    /*XSPI set Word Addressable and columspace*/
    configValue = base->SFACR;
    base->SFACR |= XSPI_SFACR_CAS(devconfig->columnSpace) | XSPI_SFACR_WA(devconfig->enableWordAddress) |
                   XSPI_SFACR_PPWB(devconfig->PageProgramBoundary) |
                   XSPI_SFACR_WA_4B_EN(devconfig->enable4BWordAddress);

    /*Set Top address for serial flash memory A1  */
    base->SFAD[0][0] = s_xspiAmbaBase[instance] + XSPI_SFAD_TPAD(devconfig->flashA1Size);
    base->SFAD[0][1] = s_xspiAmbaBase[instance] + XSPI_SFAD_TPAD(devconfig->flashA1Size) +
                   XSPI_SFAD_TPAD(devconfig->flashA2Size);

    /*xspi AHB R/W/SR CONFIG*/
    configValue |= XSPI_BFGENCR_SEQID_WR((uint32_t)devconfig->AWRSeqIndex) |
                   XSPI_BFGENCR_SEQID_WR_EN_MASK | XSPI_BFGENCR_WR_FLUSH_EN(devconfig->enableWriteFlush);

    configValue |= XSPI_BFGENCR_SEQID((uint32_t)devconfig->ARDSeqIndex);

    configValue |= XSPI_BFGENCR_SEQID_RDSR((uint32_t)devconfig->ARDSRSeqIndex) |
                   XSPI_BFGENCR_PPWF_CLR_MASK;

    base->BFGENCR |= configValue;

    /* Configure DLL. */
    XSPI_UpdateDllValue(base, devconfig);

    /* Wait for bus to be idle before use it access to external flash. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }
}

/*! brief Updates the LUT table.
 *
 * param base XSPI peripheral base address.
 * param index From which index start to update. It could be any index of the LUT table, which
 * also allows user to update command content inside a command. Each command consists of up to
 * 10 instructions and occupy 4*32-bit memory.
 * param cmd Command sequence array.
 * param count Number of sequences.
 */
void XSPI_UpdateLUT(XSPI_Type *base, uint8_t index, const uint32_t *cmd, uint8_t count)
{
    assert(index < 80U);

