JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
    uint32_t i = 0;
    volatile uint32_t *lutBase;

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    /* Unlock LUT for update. */
    base->LUTKEY = XSPI_LUT_KEY_VAL;
    base->LCKCR = 0x02;

    lutBase = &base->LUT[index];
    for (i = 0; i < count; i++)
    {
        *lutBase++ = *cmd++;
    }

    /* Lock LUT. */
    base->LUTKEY = XSPI_LUT_KEY_VAL;
    base->LCKCR = 0x01;
}

/*! brief Update read sample clock source
 *
 * param base XSPI peripheral base address.
 * param clockSource clockSource of type #xspi_read_sample_clock_t
 */
void XSPI_UpdateRxSampleClock(XSPI_Type *base, xspi_read_sample_clock_t clockSource)
{
    uint32_t mcrVal;

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    mcrVal = base->MCR;
    mcrVal &= ~XSPI_MCR_DQS_FA_SEL_MASK;
    mcrVal |= XSPI_MCR_DQS_FA_SEL(clockSource);
    base->MCR = mcrVal;

    /* Reset peripheral. */
    XSPI_SoftwareReset(base);
}

/*!
 * brief Sends a buffer of data bytes using blocking method.
 * note This function blocks via polling until all bytes have been sent.
 * param base XSPI peripheral base address
 * param buffer The data bytes to send
 * param size The number of data bytes to send
 * retval kStatus_Success write success without error
 * retval kStatus_XSPI_SequenceExecutionTimeout sequence execution timeout
 * retval kStatus_XSPI_IpCommandSequenceError IP command sequence error detected
 * retval kStatus_XSPI_IpCommandGrantTimeout IP command grant timeout detected
 */
status_t XSPI_WriteBlocking(XSPI_Type *base, uint8_t *buffer, size_t size)
{
    status_t result = kStatus_Success;
    uint32_t i      = 0;
    uint8_t fsmStatusIsValid;
    uint32_t fsmStatus;

    base->TBCT = 256 - (size/4 - 1);

    fsmStatusIsValid = (base->FSMSTAT) & XSPI_FSMSTAT_VLD_MASK >> XSPI_FSMSTAT_VLD_SHIFT;
    fsmStatus = (base->FSMSTAT & XSPI_FSMSTAT_STATE_MASK) >> XSPI_FSMSTAT_STATE_SHIFT;
    /* Wait until passed MDAD and FRAD checks and the transaction is granted the arbitration. */
    while (!((1U == fsmStatusIsValid) & (fsmStatus == (uint32_t)kXSPI_TbdrLockIsOpen ||
                                    fsmStatus == (uint32_t)kXSPI_WriteTransferIsTriggered)))
    {
    }
    /* Send data buffer */
    while (0U != size)
    {

        result = XSPI_CheckAndClearError(base, base->ERRSTAT);

        if (kStatus_Success != result)
        {
            return result;
        }

        /* Write watermark level data into tx fifo . */
            /* Write word aligned data into tx fifo. */
        for (i = 0U; i < (size / 4U); i++)
        {
            while(1 == (base->SR & XSPI_SR_TXFULL_MASK) >> XSPI_SR_TXFULL_SHIFT)
            {
            }
            base->TBDR = *(uint32_t *)buffer;
            buffer += 4U;
        }

        /* Adjust size by the amount processed. */
        size -= 4U * i;

        /* Write word un-aligned data into tx fifo. */
        if (0x00U != size)
        {
            uint32_t tempVal = 0x00U;

            for (uint32_t j = 0U; j < size; j++)
            {
                tempVal |= ((uint32_t)*buffer++ << (8U * j));
            }

            while(1 == (base->SR & XSPI_SR_TXFULL_MASK) >> XSPI_SR_TXFULL_SHIFT)
            {
            }
            base->TBDR = tempVal;
            }

            size = 0U;
        }

    /*clear TX Buffer Fill Flag*/
    base->FR |= XSPI_FR_TBFF_MASK;

    XSPI_IPS_CMD_WaitFinish(base);

    return result;
}

/*!
 * brief Receives a buffer of data bytes using a blocking method.
 * note This function blocks via polling until all bytes have been sent.
 * param base XSPI peripheral base address
 * param buffer The data bytes to send
 * param size The number of data bytes to receive
 * retval kStatus_Success read success without error
 * retval kStatus_XSPI_SequenceExecutionTimeout sequence execution timeout
 * retval kStatus_XSPI_IpCommandSequenceError IP command sequence error detected
 * retval kStatus_XSPI_IpCommandGrantTimeout IP command grant timeout detected
 */
status_t XSPI_ReadBlocking(XSPI_Type *base, uint8_t *buffer, size_t size)
{
    uint32_t rxWatermark = base->RBCT + 1;
    status_t result = kStatus_Success;
    uint32_t i      = 0;

    while(1 != (base->SR & XSPI_SR_BUSY_MASK) && ((base->SR & XSPI_SR_IP_ACC_MASK) >> XSPI_SR_IP_ACC_SHIFT))
    {
    }
    /* Send data buffer */
    while (0U != size)
    {

        result = XSPI_CheckAndClearError(base, base->ERRSTAT);

        if (kStatus_Success != result)
        {
            break;
        }

        /* Read word aligned data from rx fifo. */
        if (size >= 4 * rxWatermark)
        {
            while(0 == (base->SR & XSPI_SR_RXWE_MASK) >> XSPI_SR_RXWE_SHIFT)
            {
            }
            for (i = 0U; i < rxWatermark; i++)
            {
                *(uint32_t *)buffer = base->RBDR[i];
                buffer += 4U;
            }

            /* RX buffer POP */
            base->FR |= XSPI_FR_RBDF_MASK;
            size = size - 4U * rxWatermark;
        }
        else
        {
            for (i = 0U; i < (size / 4U); i++)
            {
                *(uint32_t *)buffer = base->RBDR[i];
                buffer += 4U;
            }

            /* Adjust size by the amount processed. */
            size -= 4U * i;

            /* Read word un-aligned data from rx fifo. */
            if (0x00U != size)
            {
                uint32_t tempVal = base->RBDR[i];

                for (i = 0U; i < size; i++)
                {
                    *buffer++ = ((uint8_t)(tempVal >> (8U * i)) & 0xFFU);
                }
            }

            size = 0;
        }
    }

    return result;
}

/*!
 * brief Execute command to transfer a buffer data bytes using a blocking method.
 * param base XSPI peripheral base address
 * param xfer pointer to the transfer structure.
 * retval kStatus_Success command transfer success without error
 * retval kStatus_XSPI_SequenceExecutionTimeout sequence execution timeout
 * retval kStatus_XSPI_IpCommandSequenceError IP command sequence error detected
 * retval kStatus_XSPI_IpCommandGrantTimeout IP command grant timeout detected
 */
status_t XSPI_TransferBlocking(XSPI_Type *base, xspi_transfer_t *xfer)
{
    uint32_t configValue = 0;
    status_t result      = kStatus_Success;

