JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
    if (xfer->targetGroup == kXSPI_TargetGroup1)
    {
        /*check the target groupe 1 is empty*/
        while (0U != ((base->SUB_REG_MDAM_ARRAY[0].TGSFARS_SUB & XSPI_TGSFARS_SUB_VLD_MASK) >> XSPI_TGSFARS_SUB_VLD_SHIFT))
        {
        }

        /* Set target groupe 1 Serial Flash Address register*/
        base->SUB_REG_MDAM_ARRAY[0].SFP_TG_SUB_SFAR = xfer->deviceAddress;

        /* Configure target groupe 1 data size. */
        if ((xfer->cmdType == kXSPI_Read) || (xfer->cmdType == kXSPI_Write) || (xfer->cmdType == kXSPI_Config))
        {
            configValue = XSPI_SFP_TG_SUB_IPCR_IDATSZ(xfer->dataSize);
        }

        /*config target groupe 1 data size sequence ID.*/
        configValue |= XSPI_SFP_TG_SUB_IPCR_SEQID(xfer->seqIndex);
        base->SUB_REG_MDAM_ARRAY[0].SFP_TG_SUB_IPCR = configValue;
    }
    else
    {
         /*check the target groupe 0 is empty*/
        while (0U != ((base->TGSFARS & XSPI_TGSFARS_VLD_MASK) >> XSPI_TGSFARS_VLD_SHIFT))
        {
        }

        /* Set target groupe 0 Serial Flash Address register*/
        base->SFP_TG_SFAR = xfer->deviceAddress;

        /* Configure target groupe 0 data size. */
        if ((xfer->cmdType == kXSPI_Read) || (xfer->cmdType == kXSPI_Write) || (xfer->cmdType == kXSPI_Config))
        {
            configValue = XSPI_SFP_TG_IPCR_IDATSZ(xfer->dataSize);
        }

        /*config target groupe 0 data size sequence ID.*/
        configValue |= XSPI_SFP_TG_IPCR_SEQID(xfer->seqIndex);
        base->SFP_TG_IPCR = configValue;
    }

    /* Just Clear RX  TX FIFO PT*/
    base->MCR |= XSPI_MCR_CLR_RXF_MASK;
    base->MCR |= XSPI_MCR_CLR_TXF_MASK;

    if ((xfer->cmdType == kXSPI_Write) || (xfer->cmdType == kXSPI_Config))
    {
        result = XSPI_WriteBlocking(base, (uint8_t *)xfer->data, xfer->dataSize);
    }
    else if (xfer->cmdType == kXSPI_Read)
    {
        /*wait ip cmd finish*/
        XSPI_IPS_CMD_WaitFinish(base);
        result = XSPI_ReadBlocking(base, (uint8_t *)xfer->data, xfer->dataSize);
    }
    else
    {
        /* Empty else. */
    }

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    if (xfer->cmdType == kXSPI_Command)
    {
        result = XSPI_CheckAndClearError(base, base->ERRSTAT);
        /*wait ip cmd finish*/
        XSPI_IPS_CMD_WaitFinish(base);
    }

    return result;
}

/*!
 * brief Initializes the XSPI handle which is used in transactional functions.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure to store the transfer state.
 * param callback pointer to user callback function.
 * param userData user parameter passed to the callback function.
 */
void XSPI_TransferCreateHandle(XSPI_Type *base,
                                  xspi_handle_t *handle,
                                  xspi_transfer_callback_t callback,
                                  void *userData)
{
    assert(NULL != handle);

    uint32_t instance = XSPI_GetInstance(base);

    /* Zero handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Set callback and userData. */
    handle->completionCallback = callback;
    handle->userData           = userData;


    /* Enable NVIC interrupt. */
    (void)EnableIRQ(s_xspiIrqs[instance]);
}

/*!
 * brief Performs a interrupt non-blocking transfer on the XSPI bus.
 *
 * note Calling the API returns immediately after transfer initiates. The user needs
 * to call XSPI_GetTransferCount to poll the transfer status to check whether
 * the transfer is finished. If the return status is not kStatus_XSPI_Busy, the transfer
 * is finished. For XSPI_Read, the dataSize should be multiple of rx watermark level, or
 * XSPI could not read data properly.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure which stores the transfer state.
 * param xfer pointer to xspi_transfer_t structure.
 * retval kStatus_Success Successfully start the data transmission.
 * retval kStatus_XSPI_Busy Previous transmission still not finished.
 */
status_t XSPI_TransferNonBlocking(XSPI_Type *base, xspi_handle_t *handle, xspi_transfer_t *xfer)
{
    uint32_t configValue = 0;
    status_t result      = kStatus_Success;

    assert(NULL != handle);
    assert(NULL != xfer);

    /* Check if the I2C bus is idle - if not return busy status. */
    if (handle->state != (uint32_t)kXSPI_Idle)
    {
        result = kStatus_XSPI_Busy;
    }
    else
    {
        handle->data              = (uint8_t *)xfer->data;
        handle->dataSize          = xfer->dataSize;
        handle->transferTotalSize = xfer->dataSize;
        handle->state = (xfer->cmdType == kXSPI_Read) ? (uint32_t)kXSPI_BusyRead : (uint32_t)kXSPI_BusyWrite;

        if (xfer->targetGroup == kXSPI_TargetGroup1)
        {
                /*check the target groupe 1 is empty*/
                while (0U != ((base->SUB_REG_MDAM_ARRAY[0].TGSFARS_SUB & XSPI_TGSFARS_SUB_VLD_MASK) >> XSPI_TGSFARS_SUB_VLD_SHIFT))
                {
                }

                /* Set target groupe 1 Serial Flash Address register*/
                base->SUB_REG_MDAM_ARRAY[0].SFP_TG_SUB_SFAR = xfer->deviceAddress;

                /* Configure target groupe 1 data size. */
                if ((xfer->cmdType == kXSPI_Read) || (xfer->cmdType == kXSPI_Write) || (xfer->cmdType == kXSPI_Config))
                {
                        configValue = XSPI_SFP_TG_SUB_IPCR_IDATSZ(xfer->dataSize);
                }

                /*config target groupe 1 data size sequence ID.*/
                configValue |= XSPI_SFP_TG_SUB_IPCR_SEQID(xfer->seqIndex);
                base->SUB_REG_MDAM_ARRAY[0].SFP_TG_SUB_IPCR = configValue;
        }
        else
        {
                 /*check the target groupe 0 is empty*/
                while (0U != ((base->TGSFARS & XSPI_TGSFARS_VLD_MASK) >> XSPI_TGSFARS_VLD_SHIFT))
                {
                }

                /* Set target groupe 0 Serial Flash Address register*/
                base->SFP_TG_SFAR = xfer->deviceAddress;

                /* Configure target groupe 0 data size. */
                if ((xfer->cmdType == kXSPI_Read) || (xfer->cmdType == kXSPI_Write) || (xfer->cmdType == kXSPI_Config))
                {
                        configValue = XSPI_SFP_TG_IPCR_IDATSZ(xfer->dataSize);
                }

                /*config target groupe 0 data size sequence ID.*/
                configValue |= XSPI_SFP_TG_IPCR_SEQID(xfer->seqIndex);
                base->SFP_TG_IPCR = configValue;
        }

        /* Just Clear RX  TX FIFO PT*/
        base->MCR |= XSPI_MCR_CLR_RXF_MASK;
        base->MCR |= XSPI_MCR_CLR_TXF_MASK;



