JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.c
        if (handle->state == (uint32_t)kXSPI_BusyRead)
        {
            XSPI_EnableInterrupts(base, (uint32_t)kXSPI_RxBufferOverflowFlag |
                                        (uint32_t)kXSPI_RxBufferDrainFlag |
                                        (uint32_t)kXSPI_IpCmdtriggerErrorFlag |
                                        (uint32_t)kXSPI_IllegalInstructionErrorFlag);
        }
        else
        {
            XSPI_EnableInterrupts(
                base, (uint32_t)kXSPI_TxBufferFillFlag | (uint32_t)kXSPI_TxBufferUnderrunFlag |
                      (uint32_t)kXSPI_IpCmdtriggerErrorFlag | (uint32_t)kXSPI_IllegalInstructionErrorFlag);
        }
    }

    return result;
}

/*!
 * brief Gets the master transfer status during a interrupt non-blocking transfer.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure which stores the transfer state.
 * param count Number of bytes transferred so far by the non-blocking transaction.
 * retval kStatus_InvalidArgument count is Invalid.
 * retval kStatus_Success Successfully return the count.
 */
status_t XSPI_TransferGetCount(XSPI_Type *base, xspi_handle_t *handle, size_t *count)
{
    assert(NULL != handle);

    status_t result = kStatus_Success;

    if (handle->state == (uint32_t)kXSPI_Idle)
    {
        result = kStatus_NoTransferInProgress;
    }
    else
    {
        *count = handle->transferTotalSize - handle->dataSize;
    }

    return result;
}

/*!
 * brief Aborts an interrupt non-blocking transfer early.
 *
 * note This API can be called at any time when an interrupt non-blocking transfer initiates
 * to abort the transfer early.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure which stores the transfer state
 */
void XSPI_TransferAbort(XSPI_Type *base, xspi_handle_t *handle)
{
    assert(NULL != handle);

    XSPI_DisableInterrupts(base, (uint32_t)kIrqFlags);
    handle->state = (uint32_t)kXSPI_Idle;
}
